; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-5-5-10)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	s13 - location
	s14 - location
	p0-1 - location
	p0-4 - location
	p1-2 - location
	p1-5 - location
	p2-3 - location
	p2-6 - location
	p3-7 - location
	p3-10 - location
	p3-11 - location
	p4-0 - location
	p4-6 - location
	p5-14 - location
	p7-9 - location
	p7-13 - location
	p8-12 - location
	p9-0 - location
	p9-4 - location
	p9-6 - location
	p9-8 - location
	p10-0 - location
	p12-4 - location
	p12-14 - location
	p13-1 - location
	p13-9 - location
	p13-14 - location
	p14-0 - location
	p14-8 - location
	p14-9 - location
	)
	(:init
	(at driver1 s14)
	(at driver2 s1)
	(at driver3 s0)
	(at driver4 s10)
	(at driver5 s12)
	(at truck1 s7)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s13)
	(empty truck4)
	(at truck5 s3)
	(empty truck5)
	(at package1 s0)
	(at package2 s14)
	(at package3 s4)
	(at package4 s3)
	(at package5 s11)
	(at package6 s7)
	(at package7 s12)
	(at package8 s8)
	(at package9 s2)
	(at package10 s7)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(path s3 p3-10)
	(path p3-10 s3)
	(path s10 p3-10)
	(path p3-10 s10)
	(path s3 p3-11)
	(path p3-11 s3)
	(path s11 p3-11)
	(path p3-11 s11)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(path s5 p5-14)
	(path p5-14 s5)
	(path s14 p5-14)
	(path p5-14 s14)
	(path s7 p7-9)
	(path p7-9 s7)
	(path s9 p7-9)
	(path p7-9 s9)
	(path s7 p7-13)
	(path p7-13 s7)
	(path s13 p7-13)
	(path p7-13 s13)
	(path s8 p8-12)
	(path p8-12 s8)
	(path s12 p8-12)
	(path p8-12 s12)
	(path s9 p9-0)
	(path p9-0 s9)
	(path s0 p9-0)
	(path p9-0 s0)
	(path s9 p9-4)
	(path p9-4 s9)
	(path s4 p9-4)
	(path p9-4 s4)
	(path s9 p9-6)
	(path p9-6 s9)
	(path s6 p9-6)
	(path p9-6 s6)
	(path s9 p9-8)
	(path p9-8 s9)
	(path s8 p9-8)
	(path p9-8 s8)
	(path s10 p10-0)
	(path p10-0 s10)
	(path s0 p10-0)
	(path p10-0 s0)
	(path s12 p12-4)
	(path p12-4 s12)
	(path s4 p12-4)
	(path p12-4 s4)
	(path s12 p12-14)
	(path p12-14 s12)
	(path s14 p12-14)
	(path p12-14 s14)
	(path s13 p13-1)
	(path p13-1 s13)
	(path s1 p13-1)
	(path p13-1 s1)
	(path s13 p13-9)
	(path p13-9 s13)
	(path s9 p13-9)
	(path p13-9 s9)
	(path s13 p13-14)
	(path p13-14 s13)
	(path s14 p13-14)
	(path p13-14 s14)
	(path s14 p14-0)
	(path p14-0 s14)
	(path s0 p14-0)
	(path p14-0 s0)
	(path s14 p14-8)
	(path p14-8 s14)
	(path s8 p14-8)
	(path p14-8 s8)
	(path s14 p14-9)
	(path p14-9 s14)
	(path s9 p14-9)
	(path p14-9 s9)
	(link s0 s1)
	(link s1 s0)
	(link s0 s11)
	(link s11 s0)
	(link s0 s13)
	(link s13 s0)
	(link s0 s14)
	(link s14 s0)
	(link s1 s2)
	(link s2 s1)
	(link s1 s8)
	(link s8 s1)
	(link s1 s10)
	(link s10 s1)
	(link s1 s13)
	(link s13 s1)
	(link s2 s11)
	(link s11 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s1)
	(link s1 s3)
	(link s3 s10)
	(link s10 s3)
	(link s3 s11)
	(link s11 s3)
	(link s3 s12)
	(link s12 s3)
	(link s5 s0)
	(link s0 s5)
	(link s5 s2)
	(link s2 s5)
	(link s5 s3)
	(link s3 s5)
	(link s5 s7)
	(link s7 s5)
	(link s6 s0)
	(link s0 s6)
	(link s6 s1)
	(link s1 s6)
	(link s6 s5)
	(link s5 s6)
	(link s6 s7)
	(link s7 s6)
	(link s6 s8)
	(link s8 s6)
	(link s7 s2)
	(link s2 s7)
	(link s7 s4)
	(link s4 s7)
	(link s7 s9)
	(link s9 s7)
	(link s7 s10)
	(link s10 s7)
	(link s7 s11)
	(link s11 s7)
	(link s8 s0)
	(link s0 s8)
	(link s8 s3)
	(link s3 s8)
	(link s10 s0)
	(link s0 s10)
	(link s10 s2)
	(link s2 s10)
	(link s10 s4)
	(link s4 s10)
	(link s10 s5)
	(link s5 s10)
	(link s10 s6)
	(link s6 s10)
	(link s12 s0)
	(link s0 s12)
	(link s12 s5)
	(link s5 s12)
	(link s12 s6)
	(link s6 s12)
	(link s12 s10)
	(link s10 s12)
	(link s13 s2)
	(link s2 s13)
	(link s13 s7)
	(link s7 s13)
	(link s13 s10)
	(link s10 s13)
	(link s13 s11)
	(link s11 s13)
	(link s14 s6)
	(link s6 s14)
	(link s14 s12)
	(link s12 s14)
)
	(:goal (and
	(at driver1 s12)
	(at driver2 s11)
	(at driver3 s11)
	(at driver4 s12)
	(at driver5 s11)
	(at truck1 s5)
	(at truck2 s6)
	(at truck3 s8)
	(at truck4 s12)
	(at truck5 s14)
	(at package1 s13)
	(at package2 s0)
	(at package4 s11)
	(at package5 s9)
	(at package6 s2)
	(at package7 s3)
	(at package8 s6)
	(at package9 s4)
	(at package10 s8)
	))

)

; plan
1. (board-truck driver2 truck2 s1)
   deleted: (at driver2 s1) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 0 of 19
2. (drive-truck truck2 s1 s10 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s10)
   goals met: 0 of 19
3. (drive-truck truck2 s10 s12 driver2)
   deleted: (at truck2 s10)
   added: (at truck2 s12)
   goals met: 0 of 19
4. (drive-truck truck2 s12 s6 driver2)
   deleted: (at truck2 s12)
   added: (at truck2 s6)
   goals met: 1 of 19
5. (walk driver1 s14 p12-14)
   deleted: (at driver1 s14)
   added: (at driver1 p12-14)
   goals met: 1 of 19
6. (walk driver1 p12-14 s12)
   deleted: (at driver1 p12-14)
   added: (at driver1 s12)
   goals met: 2 of 19
7. (walk driver4 s10 p3-10)
   deleted: (at driver4 s10)
   added: (at driver4 p3-10)
   goals met: 2 of 19
8. (drive-truck truck2 s6 s7 driver2)
   deleted: (at truck2 s6)
   added: (at truck2 s7)
   goals met: 1 of 19
9. (drive-truck truck2 s7 s11 driver2)
   deleted: (at truck2 s7)
   added: (at truck2 s11)
   goals met: 1 of 19
10. (load-truck package5 truck2 s11)
   deleted: (at package5 s11)
   added: (in package5 truck2)
   goals met: 1 of 19
11. (walk driver4 p3-10 s3)
   deleted: (at driver4 p3-10)
   added: (at driver4 s3)
   goals met: 1 of 19
12. (drive-truck truck2 s11 s13 driver2)
   deleted: (at truck2 s11)
   added: (at truck2 s13)
   goals met: 1 of 19
13. (load-truck package4 truck5 s3)
   deleted: (at package4 s3)
   added: (in package4 truck5)
   goals met: 1 of 19
14. (drive-truck truck2 s13 s7 driver2)
   deleted: (at truck2 s13)
   added: (at truck2 s7)
   goals met: 1 of 19
15. (load-truck package6 truck2 s7)
   deleted: (at package6 s7)
   added: (in package6 truck2)
   goals met: 1 of 19
16. (load-truck package10 truck2 s7)
   deleted: (at package10 s7)
   added: (in package10 truck2)
   goals met: 1 of 19
17. (board-truck driver4 truck5 s3)
   deleted: (at driver4 s3) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 1 of 19
18. (drive-truck truck5 s3 s11 driver4)
   deleted: (at truck5 s3)
   added: (at truck5 s11)
   goals met: 1 of 19
19. (unload-truck package4 truck5 s11)
   deleted: (in package4 truck5)
   added: (at package4 s11)
   goals met: 2 of 19
20. (drive-truck truck2 s7 s6 driver2)
   deleted: (at truck2 s7)
   added: (at truck2 s6)
   goals met: 3 of 19
21. (drive-truck truck5 s11 s0 driver4)
   deleted: (at truck5 s11)
   added: (at truck5 s0)
   goals met: 3 of 19
22. (drive-truck truck5 s0 s14 driver4)
   deleted: (at truck5 s0)
   added: (at truck5 s14)
   goals met: 4 of 19
23. (load-truck package2 truck5 s14)
   deleted: (at package2 s14)
   added: (in package2 truck5)
   goals met: 4 of 19
24. (drive-truck truck2 s6 s7 driver2)
   deleted: (at truck2 s6)
   added: (at truck2 s7)
   goals met: 3 of 19
25. (drive-truck truck5 s14 s12 driver4)
   deleted: (at truck5 s14)
   added: (at truck5 s12)
   goals met: 2 of 19
26. (disembark-truck driver4 truck5 s12)
   deleted: (driving driver4 truck5)
   added: (at driver4 s12) (empty truck5)
   goals met: 3 of 19
27. (load-truck package7 truck5 s12)
   deleted: (at package7 s12)
   added: (in package7 truck5)
   goals met: 3 of 19
28. (board-truck driver5 truck5 s12)
   deleted: (at driver5 s12) (empty truck5)
   added: (driving driver5 truck5)
   goals met: 3 of 19
29. (drive-truck truck5 s12 s0 driver5)
   deleted: (at truck5 s12)
   added: (at truck5 s0)
   goals met: 3 of 19
30. (disembark-truck driver5 truck5 s0)
   deleted: (driving driver5 truck5)
   added: (at driver5 s0) (empty truck5)
   goals met: 3 of 19
31. (unload-truck package2 truck5 s0)
   deleted: (in package2 truck5)
   added: (at package2 s0)
   goals met: 4 of 19
32. (load-truck package1 truck5 s0)
   deleted: (at package1 s0)
   added: (in package1 truck5)
   goals met: 4 of 19
33. (board-truck driver3 truck5 s0)
   deleted: (at driver3 s0) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 4 of 19
34. (drive-truck truck5 s0 s11 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s11)
   goals met: 4 of 19
35. (drive-truck truck5 s11 s13 driver3)
   deleted: (at truck5 s11)
   added: (at truck5 s13)
   goals met: 4 of 19
36. (unload-truck package1 truck5 s13)
   deleted: (in package1 truck5)
   added: (at package1 s13)
   goals met: 5 of 19
37. (drive-truck truck2 s7 s2 driver2)
   deleted: (at truck2 s7)
   added: (at truck2 s2)
   goals met: 5 of 19
38. (load-truck package9 truck2 s2)
   deleted: (at package9 s2)
   added: (in package9 truck2)
   goals met: 5 of 19
39. (unload-truck package6 truck2 s2)
   deleted: (in package6 truck2)
   added: (at package6 s2)
   goals met: 6 of 19
40. (drive-truck truck2 s2 s7 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s7)
   goals met: 6 of 19
41. (drive-truck truck2 s7 s6 driver2)
   deleted: (at truck2 s7)
   added: (at truck2 s6)
   goals met: 7 of 19
42. (drive-truck truck5 s13 s11 driver3)
   deleted: (at truck5 s13)
   added: (at truck5 s11)
   goals met: 7 of 19
43. (disembark-truck driver3 truck5 s11)
   deleted: (driving driver3 truck5)
   added: (at driver3 s11) (empty truck5)
   goals met: 8 of 19
44. (disembark-truck driver2 truck2 s6)
   deleted: (driving driver2 truck2)
   added: (at driver2 s6) (empty truck2)
   goals met: 8 of 19
45. (walk driver2 s6 p2-6)
   deleted: (at driver2 s6)
   added: (at driver2 p2-6)
   goals met: 8 of 19
46. (walk driver2 p2-6 s2)
   deleted: (at driver2 p2-6)
   added: (at driver2 s2)
   goals met: 8 of 19
47. (board-truck driver2 truck3 s2)
   deleted: (at driver2 s2) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 8 of 19
48. (drive-truck truck3 s2 s1 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   goals met: 8 of 19
49. (drive-truck truck3 s1 s8 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s8)
   goals met: 9 of 19
50. (unload-truck package9 truck2 s6)
   deleted: (in package9 truck2)
   added: (at package9 s6)
   goals met: 9 of 19
51. (drive-truck truck3 s8 s6 driver2)
   deleted: (at truck3 s8)
   added: (at truck3 s6)
   goals met: 8 of 19
52. (unload-truck package5 truck2 s6)
   deleted: (in package5 truck2)
   added: (at package5 s6)
   goals met: 8 of 19
53. (unload-truck package10 truck2 s6)
   deleted: (in package10 truck2)
   added: (at package10 s6)
   goals met: 8 of 19
54. (load-truck package9 truck3 s6)
   deleted: (at package9 s6)
   added: (in package9 truck3)
   goals met: 8 of 19
55. (load-truck package5 truck3 s6)
   deleted: (at package5 s6)
   added: (in package5 truck3)
   goals met: 8 of 19
56. (load-truck package10 truck3 s6)
   deleted: (at package10 s6)
   added: (in package10 truck3)
   goals met: 8 of 19
57. (drive-truck truck3 s6 s8 driver2)
   deleted: (at truck3 s6)
   added: (at truck3 s8)
   goals met: 9 of 19
58. (unload-truck package10 truck3 s8)
   deleted: (in package10 truck3)
   added: (at package10 s8)
   goals met: 10 of 19
59. (load-truck package8 truck3 s8)
   deleted: (at package8 s8)
   added: (in package8 truck3)
   goals met: 10 of 19
60. (drive-truck truck3 s8 s6 driver2)
   deleted: (at truck3 s8)
   added: (at truck3 s6)
   goals met: 9 of 19
61. (unload-truck package8 truck3 s6)
   deleted: (in package8 truck3)
   added: (at package8 s6)
   goals met: 10 of 19
62. (drive-truck truck3 s6 s7 driver2)
   deleted: (at truck3 s6)
   added: (at truck3 s7)
   goals met: 10 of 19
63. (drive-truck truck3 s7 s4 driver2)
   deleted: (at truck3 s7)
   added: (at truck3 s4)
   goals met: 10 of 19
64. (unload-truck package9 truck3 s4)
   deleted: (in package9 truck3)
   added: (at package9 s4)
   goals met: 11 of 19
65. (drive-truck truck3 s4 s7 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s7)
   goals met: 11 of 19
66. (drive-truck truck3 s7 s9 driver2)
   deleted: (at truck3 s7)
   added: (at truck3 s9)
   goals met: 11 of 19
67. (unload-truck package5 truck3 s9)
   deleted: (in package5 truck3)
   added: (at package5 s9)
   goals met: 12 of 19
68. (board-truck driver3 truck5 s11)
   deleted: (at driver3 s11) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 11 of 19
69. (drive-truck truck3 s9 s7 driver2)
   deleted: (at truck3 s9)
   added: (at truck3 s7)
   goals met: 11 of 19
70. (drive-truck truck3 s7 s11 driver2)
   deleted: (at truck3 s7)
   added: (at truck3 s11)
   goals met: 11 of 19
71. (disembark-truck driver2 truck3 s11)
   deleted: (driving driver2 truck3)
   added: (at driver2 s11) (empty truck3)
   goals met: 12 of 19
72. (drive-truck truck5 s11 s0 driver3)
   deleted: (at truck5 s11)
   added: (at truck5 s0)
   goals met: 12 of 19
73. (drive-truck truck5 s0 s14 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s14)
   goals met: 13 of 19
74. (disembark-truck driver3 truck5 s14)
   deleted: (driving driver3 truck5)
   added: (at driver3 s14) (empty truck5)
   goals met: 13 of 19
75. (walk driver3 s14 p13-14)
   deleted: (at driver3 s14)
   added: (at driver3 p13-14)
   goals met: 13 of 19
76. (walk driver3 p13-14 s13)
   deleted: (at driver3 p13-14)
   added: (at driver3 s13)
   goals met: 13 of 19
77. (board-truck driver3 truck4 s13)
   deleted: (at driver3 s13) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 13 of 19
78. (drive-truck truck4 s13 s0 driver3)
   deleted: (at truck4 s13)
   added: (at truck4 s0)
   goals met: 13 of 19
79. (drive-truck truck4 s0 s12 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s12)
   goals met: 14 of 19
80. (unload-truck package7 truck5 s14)
   deleted: (in package7 truck5)
   added: (at package7 s14)
   goals met: 14 of 19
81. (board-truck driver2 truck3 s11)
   deleted: (at driver2 s11) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 13 of 19
82. (drive-truck truck4 s12 s14 driver3)
   deleted: (at truck4 s12)
   added: (at truck4 s14)
   goals met: 12 of 19
83. (load-truck package7 truck4 s14)
   deleted: (at package7 s14)
   added: (in package7 truck4)
   goals met: 12 of 19
84. (drive-truck truck4 s14 s0 driver3)
   deleted: (at truck4 s14)
   added: (at truck4 s0)
   goals met: 12 of 19
85. (drive-truck truck4 s0 s11 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s11)
   goals met: 12 of 19
86. (drive-truck truck4 s11 s3 driver3)
   deleted: (at truck4 s11)
   added: (at truck4 s3)
   goals met: 12 of 19
87. (unload-truck package7 truck4 s3)
   deleted: (in package7 truck4)
   added: (at package7 s3)
   goals met: 13 of 19
88. (drive-truck truck4 s3 s12 driver3)
   deleted: (at truck4 s3)
   added: (at truck4 s12)
   goals met: 14 of 19
89. (drive-truck truck3 s11 s0 driver2)
   deleted: (at truck3 s11)
   added: (at truck3 s0)
   goals met: 14 of 19
90. (drive-truck truck3 s0 s8 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s8)
   goals met: 15 of 19
91. (disembark-truck driver3 truck4 s12)
   deleted: (driving driver3 truck4)
   added: (at driver3 s12) (empty truck4)
   goals met: 15 of 19
92. (disembark-truck driver2 truck3 s8)
   deleted: (driving driver2 truck3)
   added: (at driver2 s8) (empty truck3)
   goals met: 15 of 19
93. (walk driver2 s8 p9-8)
   deleted: (at driver2 s8)
   added: (at driver2 p9-8)
   goals met: 15 of 19
94. (board-truck driver3 truck4 s12)
   deleted: (at driver3 s12) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 15 of 19
95. (walk driver2 p9-8 s9)
   deleted: (at driver2 p9-8)
   added: (at driver2 s9)
   goals met: 15 of 19
96. (walk driver2 s9 p7-9)
   deleted: (at driver2 s9)
   added: (at driver2 p7-9)
   goals met: 15 of 19
97. (walk driver2 p7-9 s7)
   deleted: (at driver2 p7-9)
   added: (at driver2 s7)
   goals met: 15 of 19
98. (board-truck driver2 truck1 s7)
   deleted: (at driver2 s7) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 15 of 19
99. (drive-truck truck1 s7 s11 driver2)
   deleted: (at truck1 s7)
   added: (at truck1 s11)
   goals met: 15 of 19
100. (drive-truck truck1 s11 s0 driver2)
   deleted: (at truck1 s11)
   added: (at truck1 s0)
   goals met: 15 of 19
101. (drive-truck truck1 s0 s5 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   goals met: 16 of 19
102. (disembark-truck driver3 truck4 s12)
   deleted: (driving driver3 truck4)
   added: (at driver3 s12) (empty truck4)
   goals met: 16 of 19
103. (disembark-truck driver2 truck1 s5)
   deleted: (driving driver2 truck1)
   added: (at driver2 s5) (empty truck1)
   goals met: 16 of 19
104. (walk driver5 s0 p10-0)
   deleted: (at driver5 s0)
   added: (at driver5 p10-0)
   goals met: 16 of 19
105. (board-truck driver2 truck1 s5)
   deleted: (at driver2 s5) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 16 of 19
106. (walk driver5 p10-0 s10)
   deleted: (at driver5 p10-0)
   added: (at driver5 s10)
   goals met: 16 of 19
107. (walk driver5 s10 p3-10)
   deleted: (at driver5 s10)
   added: (at driver5 p3-10)
   goals met: 16 of 19
108. (walk driver5 p3-10 s3)
   deleted: (at driver5 p3-10)
   added: (at driver5 s3)
   goals met: 16 of 19
109. (walk driver5 s3 p3-11)
   deleted: (at driver5 s3)
   added: (at driver5 p3-11)
   goals met: 16 of 19
110. (walk driver5 p3-11 s11)
   deleted: (at driver5 p3-11)
   added: (at driver5 s11)
   goals met: 17 of 19
111. (drive-truck truck1 s5 s12 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s12)
   goals met: 16 of 19
112. (drive-truck truck1 s12 s3 driver2)
   deleted: (at truck1 s12)
   added: (at truck1 s3)
   goals met: 16 of 19
113. (disembark-truck driver2 truck1 s3)
   deleted: (driving driver2 truck1)
   added: (at driver2 s3) (empty truck1)
   goals met: 16 of 19
114. (walk driver2 s3 p3-11)
   deleted: (at driver2 s3)
   added: (at driver2 p3-11)
   goals met: 16 of 19
115. (walk driver2 p3-11 s11)
   deleted: (at driver2 p3-11)
   added: (at driver2 s11)
   goals met: 17 of 19
116. (board-truck driver1 truck4 s12)
   deleted: (at driver1 s12) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 16 of 19
117. (drive-truck truck4 s12 s3 driver1)
   deleted: (at truck4 s12)
   added: (at truck4 s3)
   goals met: 15 of 19
118. (disembark-truck driver1 truck4 s3)
   deleted: (driving driver1 truck4)
   added: (at driver1 s3) (empty truck4)
   goals met: 15 of 19
119. (board-truck driver1 truck1 s3)
   deleted: (at driver1 s3) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 15 of 19
120. (drive-truck truck1 s3 s5 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   goals met: 16 of 19
121. (drive-truck truck1 s5 s7 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s7)
   goals met: 15 of 19
122. (disembark-truck driver1 truck1 s7)
   deleted: (driving driver1 truck1)
   added: (at driver1 s7) (empty truck1)
   goals met: 15 of 19
123. (walk driver3 s12 p12-4)
   deleted: (at driver3 s12)
   added: (at driver3 p12-4)
   goals met: 15 of 19
124. (board-truck driver1 truck1 s7)
   deleted: (at driver1 s7) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 15 of 19
125. (drive-truck truck1 s7 s5 driver1)
   deleted: (at truck1 s7)
   added: (at truck1 s5)
   goals met: 16 of 19
126. (drive-truck truck1 s5 s3 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   goals met: 15 of 19
127. (disembark-truck driver1 truck1 s3)
   deleted: (driving driver1 truck1)
   added: (at driver1 s3) (empty truck1)
   goals met: 15 of 19
128. (board-truck driver1 truck4 s3)
   deleted: (at driver1 s3) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 15 of 19
129. (drive-truck truck4 s3 s12 driver1)
   deleted: (at truck4 s3)
   added: (at truck4 s12)
   goals met: 16 of 19
130. (disembark-truck driver1 truck4 s12)
   deleted: (driving driver1 truck4)
   added: (at driver1 s12) (empty truck4)
   goals met: 17 of 19
131. (walk driver2 s11 p3-11)
   deleted: (at driver2 s11)
   added: (at driver2 p3-11)
   goals met: 16 of 19
132. (walk driver2 p3-11 s3)
   deleted: (at driver2 p3-11)
   added: (at driver2 s3)
   goals met: 16 of 19
133. (board-truck driver2 truck1 s3)
   deleted: (at driver2 s3) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 16 of 19
134. (drive-truck truck1 s3 s5 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   goals met: 17 of 19
135. (drive-truck truck1 s5 s7 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s7)
   goals met: 16 of 19
136. (walk driver3 p12-4 s4)
   deleted: (at driver3 p12-4)
   added: (at driver3 s4)
   goals met: 16 of 19
137. (drive-truck truck1 s7 s11 driver2)
   deleted: (at truck1 s7)
   added: (at truck1 s11)
   goals met: 16 of 19
138. (disembark-truck driver2 truck1 s11)
   deleted: (driving driver2 truck1)
   added: (at driver2 s11) (empty truck1)
   goals met: 17 of 19
139. (walk driver3 s4 p0-4)
   deleted: (at driver3 s4)
   added: (at driver3 p0-4)
   goals met: 17 of 19
140. (walk driver3 p0-4 s0)
   deleted: (at driver3 p0-4)
   added: (at driver3 s0)
   goals met: 17 of 19
141. (board-truck driver2 truck1 s11)
   deleted: (at driver2 s11) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 16 of 19
142. (drive-truck truck1 s11 s0 driver2)
   deleted: (at truck1 s11)
   added: (at truck1 s0)
   goals met: 16 of 19
143. (drive-truck truck1 s0 s5 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   goals met: 17 of 19
144. (disembark-truck driver2 truck1 s5)
   deleted: (driving driver2 truck1)
   added: (at driver2 s5) (empty truck1)
   goals met: 17 of 19
145. (walk driver3 s0 p10-0)
   deleted: (at driver3 s0)
   added: (at driver3 p10-0)
   goals met: 17 of 19
146. (walk driver3 p10-0 s10)
   deleted: (at driver3 p10-0)
   added: (at driver3 s10)
   goals met: 17 of 19
147. (walk driver3 s10 p3-10)
   deleted: (at driver3 s10)
   added: (at driver3 p3-10)
   goals met: 17 of 19
148. (walk driver3 p3-10 s3)
   deleted: (at driver3 p3-10)
   added: (at driver3 s3)
   goals met: 17 of 19
149. (walk driver3 s3 p3-11)
   deleted: (at driver3 s3)
   added: (at driver3 p3-11)
   goals met: 17 of 19
150. (walk driver3 p3-11 s11)
   deleted: (at driver3 p3-11)
   added: (at driver3 s11)
   goals met: 18 of 19
151. (walk driver2 s5 p1-5)
   deleted: (at driver2 s5)
   added: (at driver2 p1-5)
   goals met: 18 of 19
152. (walk driver2 p1-5 s1)
   deleted: (at driver2 p1-5)
   added: (at driver2 s1)
   goals met: 18 of 19
153. (walk driver2 s1 p1-2)
   deleted: (at driver2 s1)
   added: (at driver2 p1-2)
   goals met: 18 of 19
154. (walk driver2 p1-2 s2)
   deleted: (at driver2 p1-2)
   added: (at driver2 s2)
   goals met: 18 of 19
155. (walk driver2 s2 p2-3)
   deleted: (at driver2 s2)
   added: (at driver2 p2-3)
   goals met: 18 of 19
156. (walk driver2 p2-3 s3)
   deleted: (at driver2 p2-3)
   added: (at driver2 s3)
   goals met: 18 of 19
157. (walk driver2 s3 p3-11)
   deleted: (at driver2 s3)
   added: (at driver2 p3-11)
   goals met: 18 of 19
158. (walk driver2 p3-11 s11)
   deleted: (at driver2 p3-11)
   added: (at driver2 s11)
   goals met: 19 of 19
